# HasEmbeddedSchedule Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..HasEmbeddedSchedule Property
ScheduleDefinition Class See Also
---
Indicates if this ScheduleDefinition has an embedded ScheduleDefinition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool HasEmbeddedSchedule { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasEmbeddedSchedule As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasEmbeddedSchedule {
	bool get ();
}
```

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace